VERSION = "0.4.0"
# ========configuration============ 
# 模拟器的端口
TARGET_PORT = 3861
# 课程表安排，第一个子数组是第一个地点要点击的课程们，依次类推，下标从0开始数数
# 每天执行全部
TIMETABLE_TASK = [[6],[6],[6, 7],[5, 6, 7],[],[],[],[],[]]
# 悬赏通缉安排，每天会挑一个做，下标从0开始数数
# 每天执行一个：[地点下标，关卡下标，次数]
WANTED_HIGHEST_LEVEL = [[0, 8, -1], [1, 8, -1], [2, 8, -1]]
# 学院交流会安排，每天会挑一个做，下标从0开始数数
# 每天执行一个：[地点下标，关卡下标，次数]
EXCHANGE_HIGHEST_LEVEL = [[0, 1, 3], [1, 1, 3], [2, 1, 3]]
# 关卡扫荡设置，HARD和NORMAL下的数组每天会挑一个做，下标从0开始数数
# 每天执行一组：[[地点下标，关卡下标，次数], [地点下标，关卡下标，次数]]
QUEST = {
            "HARD":     [
                            [[13,1,3], [16,1,3]],
                        ],
            "NORMAL":   [
                            [[19,0,-1]],
                            [[19,1,-1]],
                            [[19,2,-1]],
                            [[19,3,-1]],
                            [[19,4,-1]],
                        ],
        }
# 点击后等待的时间，单位秒
TIME_AFTER_CLICK = 0.7
# adb.exe的路径，压缩包里包含了一个，不用改
ADB_PATH = r".\tools\adb\adb.exe"
# =================================

PIC_PATH = "./assets"
SCREENSHOT_NAME = "screenshot.png"