VERSION = "0.4.0"
# ========configuration============ 
# 模拟器的端口
TARGET_PORT = 5377
# 课程表安排，第一个子数组是第一个地点要点击的课程们
# 每天执行全部
TIMETABLE_TASK = [[7],[7],[7, 8],[6, 7, 8],[],[],[],[],[]]
# 悬赏通缉安排，每天会挑一个做
# 每天执行一个：[地点，关卡，次数]
WANTED_HIGHEST_LEVEL = [[1, 9, -1], [2, 9, -1], [3, 9, -1]]
# 学院交流会安排，每天会挑一个做
# 每天执行一个：[地点，关卡，次数]
EXCHANGE_HIGHEST_LEVEL = [[1, 2, 3], [2, 2, 3], [3, 2, 3]]
# 关卡扫荡设置，HARD和NORMAL下的数组每天会挑一个做
# 每天执行一组：[[地点，关卡，次数], [地点，关卡，次数]]
QUEST = {
            "HARD":     [
                            [[14,3,-1], [20,3,-1]],
                        ],
            "NORMAL":   [
                            [[20,1,-1]],
                            [[20,2,-1]],
                            [[20,3,-1]],
                            [[20,4,-1]],
                            [[20,5,-1]],
                        ],
        }
# 点击后等待的时间，单位秒
TIME_AFTER_CLICK = 0.7
# adb.exe的路径，压缩包里包含了一个，不用改
ADB_PATH = r".\tools\adb\adb.exe"
# =================================

PIC_PATH = "./assets"
SCREENSHOT_NAME = "screenshot.png"