VERSION = "0.6.1"
# ========configuration============ 
# 模拟器的端口
# 模拟器路径
TARGET_EMULATOR_PATH = r'C:\Program Files\BlueStacks_nxt\HD-Player.exe'
TARGET_PORT = 2719
# 课程表安排，第一个子数组是第一个地点要点击的课程们，第二个子数组是第二个地点要点击的课程们
TIMETABLE_TASK = [[],[],[7, 8],[7, 8],[7, 8],[7],[],[],[]]
# 悬赏通缉安排，每天会挑一个做
# 每天执行一个：[地点，关卡，次数]，-1表示max次
WANTED_HIGHEST_LEVEL = [
                            [1, 9, -1], # 每个月第1天，第4天...
                            [2, 9, -1], # 每个月第2天，第5天...
                            [3, 9, -1]  # 每个月第3天，第6天...
                        ]
# 学院交流会安排，每天会挑一个做
# 每天执行一个：[地点，关卡，次数]
EXCHANGE_HIGHEST_LEVEL = [
                            [1, 2, 3], # 每个月第1天，第4天...
                            [2, 2, 3], # 每个月第2天，第5天...
                            [3, 2, 3]  # 每个月第3天，第6天...
                        ]
# 活动关卡扫荡，每天会挑一个做
EVENT_QUEST_LEVEL = [
    [[10, -1]]
]
# 关卡扫荡设置，HARD和NORMAL下的数组每天会挑一个做
# 每天执行一组：[[地点，关卡，次数], [地点，关卡，次数]...]
QUEST = {
            "HARD":     [
                            [[14,3,-1], [20,3,-1]], # 每个月第1天，第2天，第三天...
                        ],
            "NORMAL":   [
                            [[20,1,5]], # 每个月第1天，第6天...
                            [[20,2,5]], # 每个月第2天，第7天...
                            [[20,3,5]], # 每个月第3天，第8天...
                            [[20,4,5]], # 每个月第4天，第9天...
                            [[20,5,5]], # 每个月第5天，第10天...
                        ],
        }
# 点击后等待的时间，单位秒
TIME_AFTER_CLICK = 0.7
# adb.exe的路径，压缩包里包含了一个，不用改
ADB_PATH = r".\tools\adb\adb.exe"
# =================================

PIC_PATH = "./assets"
SCREENSHOT_NAME = "screenshot.png"